import time
import random

class Тварина:
    def __init__(self, вид):
        self.вид = вид
        self.ім_я = ""
        self.вік = 0
        self.чи_живий = True
        self.голод = 50
        self.нудьга = 50
        self.власник = None

    def __str__(self):
        return f"{self.вид} {self.ім_я} має {self.вік} років."

    def годувати(self):
        if self.голод < 30:
            print(f"{self.ім_я} не голодний(а).")
        else:
            self.голод -= 20
            print(f"{self.ім_я} їсть.")

    def гратися(self):
        if self.нудьга < 30:
            print(f"{self.ім_я} не сумує.")
        else:
            self.нудьга -= 20
            print(f"{self.ім_я} грається.")

    def чекати(self):
        self.голод += 5
        self.нудьга += 5
        self.вік += 1
        if self.вік >= 10:
            self.чи_живий = False
            print(f"{self.ім_я} помер(ла).")
        else:
            print(f"{self.ім_я} чекає.")

    def показати_опції(self):
        print(f"Що ви хочете зробити з {self.ім_я}?")
        print("1. Погодувати")
        print("2. Погратися")
        print("3. Чекати")

    def діяти(self, вибір):
        if вибір == "1":
            self.годувати()
        elif вибір == "2":
            self.гратися()
        elif вибір == "3":
            self.чекати()

    def взаємодіяти(self, інша_тварина):
        print(f"{self.ім_я} спілкується з {інша_тварина.ім_я}.")

    def взаємодіяти_з_власником(self):
        if self.власник:
            print(f"{self.ім_я} спілкується з власником {self.власник.ім_я}.")
        else:
            print(f"{self.ім_я} немає власника.")

    def запустити(self):
        print(f"Ласкаво просимо до симулятора {self.вид} з {self.ім_я}!")
        while self.чи_живий:
            self.показати_опції()
            вибір = input("> ")
            while вибір not in ["1", "2", "3"]:
                print("Недійсний вибір. Будь ласка, введіть 1, 2 або 3.")
                вибір = input("> ")
            self.діяти(вибір)
            time.sleep(2)

# Створюємо Глєба (людину) та його кота та собаку
глєб = Тварина("Людина")
глєб.ім_я = "Глєб"

кішка_глєба = Тварина("Кішка")
кішка_глєба.ім_я = "Ася"

собака_сюзі = Тварина("Собака")
собака_сюзі.ім_я = "Ред"

# Встановлюємо власників для кота та собаки
кішка_глєба.власник = глєб
собака_сюзі.власник = глєб

print(f"{глєб.ім_я} має кота на ім'я {кішка_глєба.ім_я}.")
print(f"{глєб.ім_я} має собаку на ім'я {собака_сюзі.ім_я}.")

for _ in range(4):
    кішка_глєба.запустити()
    собака_сюзі.запустити()

print(f"{глєб.ім_я} та {глєб.ім_я} побралися і жили щасливо до самої смерті у віці 78 років.")
